Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-10-18.tmx
Source language: bo
Languages: en

source: ཙན་དན་གྱི་ཡལ་ག་ཤིན་ཏུ་འབྲེལ་བའི་བྱ་སྐྱིབས་ཤིག་ན།
en: The ṛṣi Bhīṣmottara­nirghoṣa was seated under a canopy of interlaced sandalwood branches.

source: ཐོར་ཚུགས་ཀྱི་ཅོད་པན་ཅན། པགས་པ་དང་། རྩའི་གོས་གྱོན་པ། ཤིང་ཤུན་གྱི་སྨད་ཡོགས་ཅན་རྩའི་སྟན་ལ་འདུག་པ་མཐོང་ངོ་།
en: His hair was bound into a topknot of matted locks, he wore clothing made of skins and grass, with a skirt of bark, and he was seated on a cushion of grass.

source: །མཐོང་ནས་ཀྱང་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ག་ལ་བ་དེར་སོང་སྟེ།
en: Sudhana approached the ṛṣi Bhīṣmottara­nirghoṣa.

source: ཕྱིན་ནས་ཡང་དག་པའི་དགེ་བའི་བཤེས་གཉེན་དང་ཕྲད་པའི་བསམ་པས་དགེ་བའི་བཤེས་གཉེན་ནི་ཡང་དག་པའི་ལམ་སྟོན་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་འབྱུང་བའི་སྒོ་ཡིན་པར་ཡང་དག་པར་ལྟ། ཐམས་ཅད་མཁྱེན་པའི་ས་ལ་གཞོག་པས།
en: When he had approached him, seeing that omniscience arises from the gateway of the kalyāṇamitra, the genuine kalyāṇamitra that one wishes to find, because the kalyāṇamitra teaches the true path;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་རག་ལུས་པར་ཡང་དག་པར་ལྟ།
en: seeing that omniscience is dependent on the instructions of the kalyāṇamitra because they lead one to the level of omniscience;

source: སྟོབས་བཅུའི་ཡེ་ཤེས་རིན་པོ་ཆེའི་གླིང་དུ་སྐྱེལ་བས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་མཉན་པ་ལ་རག་ལུས་པར་ཡང་དག་པར་ལྟ།
en: seeing that omniscience is dependent on the friendship of the kalyāṇamitra because they lead one to the island of the jewels of the wisdom of the ten strengths;

source: སྟོབས་བཅུའི་ཡེ་ཤེས་སྣང་བ་ཡང་དག་པར་བསྐྱེད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་སྒྲོན་མས་སྣང་བར་བྱ་བ་ཡིན་པར་ཡང་དག་པར་ལྟ།
en: seeing that omniscience is the illumination from the lamp of the kalyāṇamitra because they create the light of the wisdom of the ten strengths;

source: ཉམ་ཉེས་མེད་པར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གྲོང་དུ་ཕྱིན་པར་བྱེད་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ། མཉམ་པ་དང་མི་མཉམ་པ་ཡོངས་སུ་སྟོན་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་མར་མེ་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ།
en: seeing that the kalyāṇamitra is the road to omniscience because they lead one to the city of unimpaired omniscience, seeing that omniscience is the lamp of the kalyāṇamitra because they reveal that which is equal and unequal;

source: གཡང་སའི་འཇིགས་པ་ཐམས་ཅད་མེད་པར་བྱེད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྟེགས་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ།
en: seeing that the kalyāṇamitra is the bridge of omniscience because they eliminate all the fear of falling into crevasses;

source: བྱམས་པ་ཆེན་པོའི་སྟོབས་ཀྱིས་སིམ་པ་ཡོངས་སུ་བསྐྱེད་པའི་ཕྱིར་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གདུགས་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ།
en: seeing that the kalyāṇamitra is the parasol of omniscience because they cool through the power of great benevolence;

source: སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་བསྐྱེད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཤུགས་དྲག་པོ་ནི་དགེ་བའི་བཤེས་གཉེན་ཡིན་པར་ཡང་དག་པར་ལྟ་ཞིང་ཆོས་ཀྱི་རང་བཞིན་གྱི་ཚུལ་རབ་ཏུ་སྣང་བར་བྱེད་པས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་གསལ་བར་མཐོང་བ་ནི། དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལས་པར་མཐོང་ནས། ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ།
en: seeing that the kalyāṇamitra is the power of omniscience because they create great compassion; and seeing that reliance on the kalyāṇamitra is the clear vision of omniscience because they illuminate the way of the nature of phenomena, Sudhana threw his body onto the ground before him, prostrating to him.

source: ཕྱག་བྱས་ནས་ལངས་ཏེ། དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་བསྐོར་བ་བྱས་ནས་མདུན་དུ་འདུག་སྟེ།
en: He then rose, circumambulated the ṛṣi Bhīṣmottara­nirghoṣa many hundreds of thousands of times, keeping him to his right, and then sat down before him.

source: ཐལ་མོ་སྦྱར་ནས་ཡིད་དུ་འོང་བའི་ཚུལ་གྱིས་ཡིད་དུ་འོང་བའི་ཚིག་བརྗོད་དེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: With his hands together in homage in a pleasing way with pleasing words, he said, “Ārya, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: How does a bodhisattva train in bodhisattva conduct? How does a bodhisattva practice it?

source: འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་མཛད་དོ་ཞེས་ཐོས་ན།
en: “Ārya, I have heard that you teach and give instructions to bodhisattvas.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཤད་དུ་གསོལ།
en: Therefore, Ārya, teach me how bodhisattvas train in bodhisattva conduct and in what way they practice it!”

source: དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་བྲམ་ཟེའི་བྱིས་པ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་ལ་བལྟས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་དག་རིགས་ཀྱི་བུ་འདིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ།
en: The ṛṣi Bhīṣmottara­nirghoṣa looked at the ten thousand brahmin youths who were there and said, “Young men, this noble one has developed the aspiration for the highest, complete enlightenment.

source: སེམས་ཅན་ཐམས་ཅད་འཇིགས་པ་མེད་པ་ལ་མགྲོན་དུ་གཉེར་ཏོ།
en: He has invited all beings to become free of fear.

source: །རིགས་ཀྱི་བུ་འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་དོན་དུ་སྟ་གོན་དུ་གནས་པ་སྟེ།
en: This noble one is prepared to bring happiness and benefit to all beings.

source: ཡེ་ཤེས་རྒྱ་མཚོ་ལ་མངོན་དུ་གྱུར་པའོ།
en: He is facing an ocean of wisdom.

source: །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་བཏུང་བར་འདོད་པའོ།
en: He longs to drink the rain of the clouds of Dharma of all the tathāgatas.

source: །ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པར་འདོད་པའོ།
en: He longs to enter the ocean of all the ways of the Dharma.

source: །ཡེ་ཤེས་ཀྱི་སྣང་བ་ཆེན་པོ་ལ་གནས་པར་འདོད་པའོ། །སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་བསྡུ་བར་འདོད་པའོ།
en: He longs to be in the great light of wisdom.

source: །ཆོས་ཀྱི་ཆར་ཆེན་པོ་མངོན་པར་དབབ་པར་འདོད་པའོ།
en: He longs for the great rain of the Dharma to fall.

source: །ཡེ་ཤེས་ཆེན་པོའི་ཟླ་བ་འཇིག་རྟེན་དུ་ཤར་བར་བྱས་ཏེ། ཉོན་མོངས་པའི་གདུང་བ་ཐམས་ཅད་རབ་ཏུ་གཞིལ་བར་འདོད་པའོ།
en: He longs for the moon of great wisdom to rise over the world and extinguish all the torment of the kleśas.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་རྣམ་པར་སྤེལ་བར་འདོད་པའོ།
en: He longs to increase the roots of merit of all beings.”

source: །དེ་ནས་བྲམ་ཟེའི་བྱིས་པ་སྟོང་ཕྲག་བཅུ་པོ་དེ་དག་གིས་མེ་ཏོག་དྲི་ཞིམ་ལ་ཡིད་དུ་འོང་ཞིང་ཁ་དོག་སྣ་ཚོགས་དང་ལྡན་པ་མང་པོས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་གཏོར་ཏོ། །མངོན་པར་གཏོར་ཏོ། །རབ་ཏུ་གཏོར་ཏོ། །མངོན་པར་ཕྱག་འཚལ་ཏོ། །དེ་ལྟར་བཏུད་དེ་ཕྱག་འཚལ་ནས། གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ།
en: Then the ten thousand brahmin youths scattered beautiful flowers with lovely aromas and in various colors over Sudhana, the head merchant’s son, strewed them over him, covered him with them, paid homage to him, bowed down to him, circumambulated him, keeping him to their right, and then said these words to him:

source: ཚིག་འདི་སྐད་དུ་བརྗོད་དོ། །འདི་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པར་འགྱུར་རོ།
en: “This one will become a protector of all beings;

source: །སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བགྱིད་པར་འགྱུར་རོ། །བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་རྣམ་པར་གཅོད་པར་འགྱུར་རོ། །གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་རྣམ་པར་བཟློག་པར་འགྱུར་རོ། །མི་ཁོམ་པའི་སྒོ་ཐམས་ཅད་གཅོད་པར་འགྱུར་རོ། །སྲེད་པའི་རྒྱ་མཚོ་ཡོངས་སུ་སྐེམས་པར་འགྱུར་རོ། །སྲིད་པའི་འཆིང་བ་གཅོད་པར་འགྱུར་རོ། །སྡུག་བསྔལ་གྱི་ཕུང་པོ་རྣམ་པར་བཟློག་པར་འགྱུར་རོ། །མ་རིག་པའི་མུན་པ་སེལ་བར་འགྱུར་རོ། །བསོད་ནམས་ཀྱི་ཁོར་ཡུག་གིས་འཇིག་རྟེན་ཡོངས་སུ་བསྐོར་བར་འགྱུར་རོ། །ཡེ་ཤེས་རིན་པོ་ཆེའི་འབྱུང་གནས་སུ་ཡོངས་སུ་སྟོན་པར་འགྱུར་རོ། །ཡེ་ཤེས་ཀྱི་ཉི་མ་འཆར་བར་བགྱིད་པར་འགྱུར་རོ། །ཆོས་ཀྱི་མིག་རྣམ་པར་སྦྱོང་བར་འགྱུར་རོ། །འཇིག་རྟེན་རྣམས་ལ་མཉམ་པ་དང་མི་མཉམ་པ་ཡང་དག་པར་སྟོན་པར་འགྱུར་རོ།
en: he will end all the sufferings in the hells, he will block all the pathways to rebirth as animals, he will turn beings away from the path that leads to the world of Yama, he will close the doors to the unfortunate existences, he will dry up the ocean of existences, he will cut through the bondage of existences, he will repel the mass of suffering, he will dispel the darkness of ignorance, he will establish a Cakravāla mountain range of merit around the world, he will reveal the source of the jewels of wisdom, he will cause the sun of wisdom to rise, he will purify the eyes of Dharma, and he will reveal that which is equal and unequal in all the worlds.”

source: །དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་བྱིས་པ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བྱིས་པ་དག་གང་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདེ་བ་རབ་ཏུ་བསྐྱེད་དེ། རིམ་གྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་འཐོབ་པར་འགྱུར་རོ།
en: Then the ṛṣi Bhīṣmottara­nirghoṣa said to those youths, “Young men, when someone has developed the aspiration for the highest, complete enlightenment and practices bodhisattva conduct, they create happiness for all beings and will eventually attain omniscience.

source: །བྱིས་པ་དག་རིགས་ཀྱི་བུ་འདིས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་སྟེ། དེ་བས་ན་འདི་ནི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་སྦྱོང་བར་འགྱུར་རོ། །དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས།
en: Young men, this noble one has developed the aspiration for the highest, complete enlightenment, and therefore he will bring to completeness all the qualities of buddhahood.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱི་མི་ཐུབ་པའི་རྒྱལ་མཚན་ཐོབ་པའོ། །ནོར་བཟངས་ཀྱིས་སྨྲས་པ།
en: Then the ṛṣi Bhīṣmottara­nirghoṣa said to Sudhana, the head merchant’s son, “Noble one, I have attained the bodhisattva liberation called the banner of being invincible to others

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱིས་མི་ཐུབ་པ་འདིའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས།
en: Sudhana asked, “What is the scope of this bodhisattva liberation called the banner of being invincible to others

source: །དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་ལག་པ་གཡས་པ་བརྐྱང་སྟེ། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་མགོ་ལ་བྱུགས་ནས་ལག་པ་གཡས་པས་བཟུང་ངོ་།
en: The ṛṣi Bhīṣmottara­nirghoṣa extended his right hand and with it stroked and held the head of Sudhana, the head merchant’s son.

source: །ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་ལག་པ་གཡས་པས་བཟུང་མ་ཐག་ཏུ་དེའི་མོད་ལ་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། ཕྱོགས་བཅུར་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་སངས་རྒྱས་ཀྱི་ཞིང་མཐོང་བར་གྱུར་ཏེ།
en: As soon as the ṛṣi Bhīṣmottara­nirghoṣa held the head of Sudhana, the head merchant’s son, with his right hand, Sudhana, the head merchant’s son, saw in the ten directions buddha realms as numerous as the atoms in a million buddha realms;

source: དེ་དག་གི་དེ་བཞིན་གཤེགས་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྒྱ་སྟོང་ཕྲག་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་བདག་ཉིད་འདུག་པར་ཤེས་པར་གྱུར་ཏོ།
en: he perceived himself to be sitting at the feet of buddhas as numerous as the atoms in a million buddha realms;

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཀྱང་རྣམ་པ་གྲངས་མེད་པར་རྣམ་པར་དག་པའི་རྒྱན་དང་ལྡན་པར་མཐོང་ངོ་།
en: he saw the countless pure displays of forms within those buddha realms;

source: །དེ་དག་ནའང་དེ་བཞིན་གཤེགས་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཁ་དོག་སྣ་ཚོགས་ཅན་རྒྱན་རྣམ་པ་ཐ་དད་པ་དང་ལྡན་པ་དག་འཁོད་པ་མཐོང་ངོ་།
en: he saw the ocean of the multicolored display of the circles of followers of those tathāgatas;

source: །འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དེ་དག་ན་འང་དེ་བཞིན་གཤེགས་པའི་སྐུ་མཚན་དང་དཔེ་བྱད་བཟང་པོ་འབར་བས་བརྒྱན་པ་དག་བཞུགས་པ་མཐོང་ངོ་།
en: he saw in the midst of those oceans of the circles of followers the bodies of the tathāgatas, which were adorned with the shining signs and features of a great being;

source: །དེ་དག་ལས་ཀྱང་ཚིག་དང་ཡི་གེ་གཅིག་ལས་ཀྱང་ཕྱིར་ཕྱོགས་པ་མེད་པར་ཆོས་བསྟན་པ་ཉན་ཏོ།
en: he listened to their Dharma teachings without missing a single word or term;

source: །དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་དེ་དག་ཀྱང་ཕན་ཚུན་མ་འདྲེས་པར་ཡང་དག་པར་འཛིན་ཏོ།
en: he obtained those Dharma wheels of the tathāgatas, each distinct from the other;

source: །ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་སེམས་ཅན་གྱི་བསམ་པ་སྣ་ཚོགས་ལ་འབབ་པ་དེ་དག་ཀྱང་ཡང་དག་པར་འཛིན་ཏོ།
en: he received the rain of Dharma that fell according to the various aspirations of beings;

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སྔོན་གྱི་སྨོན་ལམ་མོས་པ་སྣ་ཚོགས་ཀྱི་སྟོབས་ཀྱིས་རྣམ་པར་སྦྱངས་པ་རྒྱ་མཚོ་ལ་ཡང་ཞུགས་སོ།
en: and he comprehended an ocean of the past prayers of those tathāgatas, which were purified by the power of various aspirations;

source: །སངས་རྒྱས་ཀྱི་ཡང་དག་པར་བསྡུ་བ་སྨོན་ལམ་སྣ་ཚོགས་རྒྱ་མཚོས་རྣམ་པར་དག་པ་རྒྱ་མཚོ་དེ་དག་ལ་ཡང་ཞུགས་སོ།
en: he also comprehended those pure oceans of various prayers, which were oceans that had been accumulated by the buddhas;

source: །སངས་རྒྱས་ཀྱི་སྐུ་མདོག་སེམས་ཅན་གྱི་བསམས་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིམ་པར་འགྱུར་བར་རྣམ་པར་དམྱིགས་པ་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: he also saw the perception of the colors of the bodies of the buddhas that satisfied beings in accordance with their wishes;

source: །སངས་རྒྱས་ཀྱི་འོད་གཟེར་གྱི་དྲ་བ་འདོད་ཆགས་དང་བྲལ་བ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་དག་པའི་རྒྱན་གྱི་དཀྱིལ་འཁོར་དེ་དག་ཀྱང་མཐོང་ངོ་།
en: he also saw the network of light rays from the buddhas as various passionless, pure displays of halos;

source: །སངས་རྒྱས་ཀྱི་སྟོབས་དེ་དག་ལའང་ཡེ་ཤེས་རྣམ་པར་སྣང་བ་བསྒྲིབས་པ་མེད་པ་དང་ལྡན་པས་ཞུགས་སོ།
en: and he also perceived the strengths of those buddhas that possessed the unobscured radiance of wisdom.

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གྱི་ཡེ་ཤེས་ཀྱི་འོད་ཀྱིས་སྣང་བར་གྱུར་པ།
en: In that way, he was illuminated by the light of wisdom from the bodhisattva liberation called the banner of being invincible to others

source: ཏིང་ངེ་འཛིན་རྣམ་པར་སྣང་མཛད་ཀྱི་སྙིང་པོ་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: he attained the illumination of the samādhi called the essence of the sun

source: ཏིང་ངེ་འཛིན་ཡེ་ཤེས་མྱི་ཟད་པའི་རྣམ་པར་ཐར་པ་དང་ལྡན་པ།
en: he possessed the samādhi called the liberation of unceasing wisdom

source: གཟུངས་ཀྱི་སྒོ་སྣང་བ་ཕྱོགས་ཀུན་གྱི་དྲ་བ་རབ་ཏུ་ཐོབ་པ། གཟུངས་ཀྱི་སྒོ་རྡོ་རྗེའི་སྙིང་པོས་སེམས་རབ་ཏུ་གསལ་བར་བྱས་པ།
en: he obtained the sight of the gateway of retention called the network in all directions

source: ཏིང་ངེ་འཛིན་ཡེ་ཤེས་བརྩེགས་པ་རྣམ་པར་ཕྱེ་བའི་ཡུལ་ལ་རྣམ་པར་ཕྱེ་བ་རབ་ཏུ་ཐོབ་པ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་གཞི་ཀུན་ནས་རྣམ་པར་བརྒྱན་པའི་སྙིང་པོ་ཡུལ་དུ་གྱུར་པ།
en: he attained the samādhi called the range of the summit of well-ordered knowledge ; he had the range of dwelling in the perfection of wisdom, which is the path with the complete array of foundations;

source: ཏིང་ངེ་འཛིན་གྱི་སྣང་བ་སངས་རྒྱས་ནམ་མཁའི་སྙིང་པོའི་དཀྱིལ་འཁོར་ལ་རབ་ཏུ་ཞུགས་པ།
en: he gained the light of the samādhi called the buddhas’ domain of the essence of space

source: ཏིང་ངེ་འཛིན་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོའི་མུ་ཁྱུད་ཀྱིས་སེམས་རབ་ཏུ་སྣང་བར་བྱས་པ།
en: his mind was illuminated by the samādhi called the rim of the Dharma wheel of all the buddhas

source: ཏིང་ངེ་འཛིན་གྱི་སྣང་བ་དུས་གསུམ་གྱི་ཡེ་ཤེས་རིན་པོ་ཆེ་མི་ཟད་པའི་དཀྱིལ་འཁོར་ལ་རབ་ཏུ་བརྩོན་པ་དེས་དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞབས་ཀྱི་དྲུང་དུ་ནི་ཉིན་ཞག་གཅིག་ལོན་པར་ཤེས་སོ།
en: and he attained the light of the samādhi called the domain of the unceasing precious knowledge of the three times

source: །ལ་ལར་ནི་ཉིན་ཞག་བདུན་ལོན་པ་སྙམ། ལ་ལར་ནི་ཟླ་བ་ཕྱེད་ལོན་པ་སྙམ། ལ་ལར་ནི་ཟླ་བ་གཅིག་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་གཅིག་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བརྒྱར་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་བརྒྱ་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་ལོ་བྱེ་བ་ཁྲག་ཁྲིག་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་ཕྱེད་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་གཅིག་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བརྒྱ་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་ཕྲག་བརྒྱ་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ། ལ་ལར་ནི་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་ལོན་པ་སྙམ་བྱེད་པ་ནས། དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞབས་ཀྱི་དྲུང་དུ་ནི་བསྐལ་པ་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པ་སྙེད་ལོན་པར་གྱུར་པ་སྙམ་བྱེད་དེ། དེ་བཞིན་གཤེགས་པ་ལ་ལའི་ཞབས་ཀྱི་དྲུང་དུ་ནི་བསྐལ་པ་འཛམ་བུའི་གླིང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལོན་པ་སྙམ་བྱེད་པ་ནས། བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལོན་པ་སྙམ་བྱེད་པར་གྱུར་ཏོ།
en: He perceived sitting at the feet of some tathāgatas for one day and night, at the feet of some for seven days, at the feet of some for half a month, at the feet of some for one month, at the feet of some for one year, at the feet of some for a hundred years, at the feet of some for a thousand years, at the feet of some for a hundred thousand years, at the feet of some for ten million years, at the feet of some for a billion years, at the feet of some for ten billion years, at the feet of some for a trillion years, at the feet of some for a quintillion years, at the feet of some for half a kalpa, at the feet of some for one kalpa, at the feet of some for a hundred kalpas, at the feet of some for a thousand kalpas, at the feet of some for a hundred thousand kalpas, at the feet of some for ten million kalpas, at the feet of some for a billion kalpas, at the feet of some for ten billion kalpas, at the feet of some for a trillion kalpas, at the feet of some for a quintillion kalpas, at the feet of some for an anabhilāpyānabhilāpya­parivarta of kalpas, at the feet of some tathāgatas for as many kalpas as there are atoms in Jambudvīpa, and so on up to at the feet of some tathāgatas for as many kalpas as there are atoms in an anabhilāpyānabhilāpya­parivarta of buddha realms.

source: །དེ་ནས་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བཏང་བ་དང་། དེས་ཡང་བདག་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱི་མདུན་དུ་འདུག་པར་ཤེས་པར་གྱུར་ཏོ།
en: Then the ṛṣi Bhīṣmottara­nirghoṣa released Sudhana, the head merchant’s son, and Sudhana perceived again that he was sitting at the feet of the ṛṣi Bhīṣmottara­nirghoṣa.

source: །དེ་ལ་དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱིས་སྨྲས་པ་རིགས་ཀྱི་བུ་དྲན་མོད།
en: The ṛṣi Bhīṣmottara­nirghoṣa asked him, “Noble one, do you remember?”

source: སྨྲས་པ་འཕགས་པ་དགེ་བའི་བཤེས་གཉེན་གྱི་བྱིན་གྱི་རླབས་ཀྱིས་དྲན་ནོ།
en: Sudhana replied, “Ārya, I remember the blessing of the kalyāṇamitra.”

source: །སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་འདི་ཤེས་པར་ཟད་ན། བྱང་ཆུབ་སེམས་དཔའ་འགྲོ་བ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་ཡེ་ཤེས་མངོན་པར་ཤེས་པ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་ཐོབ་པ། དུས་ཐམས་ཅད་དུ་འཁོར་ལོ་བསྐོར་བ།
en: The ṛṣi Bhīṣmottara­nirghoṣa said, “Noble one, I know only this bodhisattva liberation called the banner of being invincible to others

source: སངས་རྒྱས་ཀྱི་མཚན་དང་། ཡེ་ཤེས་མངོན་པར་བསྒྲུབ་པ་ལ་མཁས་པ། དེ་བཞིན་གཤེགས་པ་བྱུང་བའི་ཉི་མ་ལ་རྣམ་པར་དམིགས་པའི་རྒྱན་རབ་ཏུ་དགོད་པ་དུས་གསུམ་གྱི་ཡུལ་སྐད་གཅིག་གི་ཡེ་ཤེས་སུ་ཡང་དག་པར་སྡུད་པ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་ལུས་ཤིན་ཏུ་རྣམ་པར་བཀྲམ་པ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ལ་ཡེ་ཤེས་སྣང་བའི་རང་བཞིན་དང་ལྡན་པ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་མངོན་སུམ་དུ་མངོན་པར་ལངས་པ། སེམས་ཅན་གྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་སྤྱོད་པས། རྣམ་པར་སྤྱོད་པ་དང་མཐུན་པའི་ཚུལ་དང་ལྡན་པ་འདོད་པ་བཞིན་དུ་ཀུན་ཏུ་སྣང་ཞིང་དྲི་མ་མེད་ལ་འོད་དང་ལྡན་པའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know or describe the qualities, indicate the different prayers, know the formation of realms, comprehend the scope of the wisdom, follow the range of the samādhis, comprehend the miracles and emanations that follow the arising of the might and display of the powerful liberations, grasp the characteristics of the different bodies, describe the pure domain of the voices, or teach the radiance of the wisdom of the bodhisattvas who have attained the samādhis that have the clairvoyant knowledge that is superior to all beings, who have power over the wheel of time, who are skilled in the accomplishment of the knowledge of the signs of buddhahood, who perceive the display of the rising of the sun of the tathāgatas, who have accumulated the knowledge of the single characteristic of the range of the three times, who have bodies that are distributed through all world realms, who have bodies of wisdom that illuminate the entire realm of phenomena, who appear in accordance with the wishes of all beings, who practice an appropriate conduct in a way that is in accordance with the aspirations of beings, who shine in a way that delights, and who have the pure domain of stainless radiant wisdom?

source: ཡོན་ཏན་བརྗོད་པའམ། སྨོན་ལམ་གྱི་ཁྱད་པར་སྨོས་པའམ། ཞིང་གི་མངོན་པར་འདུ་བྱ་བ་ཤེས་པའམ། ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་འཇུག་པར་བྱ་བའམ། ཏིང་ངེ་འཛིན་གྱི་སྤྱོད་ཡུལ་གྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའམ། རྫུ་འཕྲུལ་དང་རྣམ་པར་འཕྲུལ་པ་ལ་འཇུག་པར་བྱ་བའམ། རྣམ་པར་ཐར་པའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་རྩེ་བའི་རྗེས་སུ་འབྲང་བར་བྱ་བའམ། ལུས་རྣམ་པར་ཕྱེ་བའི་མཚན་མ་གཟུང་བར་བྱ་བ་འམ། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ་བརྗོད་པ་འམ། ཡེ་ཤེས་ཀྱི་སྣང་བ་རབ་ཏུ་བསྟན་པར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་ཡུལ་ཡོངས་སུ་ཚོལ་བ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་བྲམ་ཟེ་རྒྱལ་བའི་དྲོད་ཀྱི་སྐྱེ་མཆེད་ཅེས་བྱ་བ་འདུག་གིས།
en: In this southern region, in the land called Īṣāṇa, there dwells a brahmin by the name of Jayoṣmāyatana.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: Go to him and ask him, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’ ” Then Sudhana, the head merchant’s son, was overjoyed, pleased, happy, and content.

source: དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། དྲང་སྲོང་འཇིགས་མཆོག་དབྱངས་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ་དྲང་སྲོང་འཇིག་མཆོག་དབྱངས་ཀྱི་དྲུང་ནས་སོང་ངོ་། སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: He bowed his head to the feet of the ṛṣi Bhīṣmottara­nirghoṣa, circumambulated the ṛṣi Bhīṣmottara­nirghoṣa, keeping him to his right, many hundreds of thousands of times, and, looking back again and again, departed from the ṛṣi Bhīṣmottara­nirghoṣa.

source: བམ་པོ་སུམ་ཅུ་གཉིས་པ།
en: Jayoṣmāyatana

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་གཞན་གྱིས་མི་ཐུབ་པའི་རྒྱལ་མཚན་གྱི་ཡེ་ཤེས་ཀྱིས་སྣང་བར་བྱས་པ།
en: Sudhana, the head merchant’s son, was illuminated by the wisdom of the bodhisattva liberation called the banner of being invincible to others

source: སངས་རྒྱས་ཀྱི་ཡུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མངོན་སུམ་དུ་རྣམ་པར་སྤྱོད་པ།
en: He dwelled in the direct experience of the inconceivable range of the miraculous manifestations of the buddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་མངོན་སུམ་གྱི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་ཤེས་པ།
en: He perceived the direct knowledge of inconceivable bodhisattva liberations.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡེ་ཤེས་ཀྱིས།
en: His mind was illuminated by the wisdom of inconceivable bodhisattva samādhis.

source: སེམས་སྣང་བར་གྱུར་པ་དུས་ཐམས་ཅད་དུ་ཡང་དག་པར་འཇུག་པའི་ཏིང་ངེ་འཛིན་གྱི་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པ།
en: He had attained the radiance of the wisdom of samādhi that is present at all times.

source: འདུ་ཤེས་ཀྱི་རྣམ་པ་ཐམས་ཅད་ལ་ཡང་དག་པར་འཇུག་པའི་ཏིང་ངེ་འཛིན་གྱི་ཡུལ་གྱིས་སྣང་བར་གྱུར་པ།
en: He was illuminated by the range of samādhi, in which all perceptions are present and included.

source: འགྲོ་བ་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ་དང་ལྡན་པའི་ཡེ་ཤེས་སྣང་བ་ཐོབ་པ།
en: He had obtained the light of the wisdom that transcends all worlds.

source: ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བའི་སྤྱོད་ཡུལ་ལ་རྣམ་པར་སྤྱོད་པ་མངོན་ཏུ་གྱུར་པ། གཉིས་སུ་རྣམ་པར་རྟོག་པ་མེད་པས་མཉམ་པ་ཉིད་དུ་བསྟན་པའི་ཡེ་ཤེས་ལྷུར་ལེན་པ།
en: He had the direct perception of dwelling in the entire range of the three times. He was devoted to the wisdom that teaches equality without dualistic conceptions.

source: དམྱིགས་པ་ཐམས་ཅད་ལ་རབ་ཏུ་འདལ་བའི་ཡེ་ཤེས་སྣང་བ་དང་ལྡན་པ།
en: He had the light of wisdom that pervaded throughout all objects of perception.
